[Killed] BlockStatement
controllers/authController.js:6:38
 const CustomError = require("../errors");
 const { attachCookiesToResponse, createTokenUser } = require("../utils");
 
-const register = async (req, res) => {
-	const { email, name, password } = req.body;
-
-	const emailAlreadyExists = await User.findOne({ email });
-	if (emailAlreadyExists) {
-		throw new CustomError.BadRequestError("Email already exists");
-	}
-
-	// first registered user is admin
-	const isFirstAccount = (await User.countDocuments({})) === 0;
-	const role = isFirstAccount ? "admin" : "user";
-
-	const user = await User.create({ name, email, password, role });
-	const tokenUser = createTokenUser(user);
-	attachCookiesToResponse({ res, user: tokenUser });
-	res.status(StatusCodes.CREATED).json({ user: tokenUser });
-};
+const register = async (req, res) => {};
 
 const login = async (req, res) => {
killedBy: authController @register should call findOne with correct email
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/authController.js:10:6
 	const { email, name, password } = req.body;
 
 	const emailAlreadyExists = await User.findOne({ email });
-	if (emailAlreadyExists) {
+	if (true) {
 		throw new CustomError.BadRequestError("Email already exists");
 	}
killedBy: authController @register should call findOne with correct email
statusReason: Email already exists

[Survived] ConditionalExpression
controllers/authController.js:10:6
 	const { email, name, password } = req.body;
 
 	const emailAlreadyExists = await User.findOne({ email });
-	if (emailAlreadyExists) {
+	if (false) {
 		throw new CustomError.BadRequestError("Email already exists");
 	}

[Killed] ConditionalExpression
controllers/authController.js:15:25
 	}
 
 	// first registered user is admin
-	const isFirstAccount = (await User.countDocuments({})) === 0;
+	const isFirstAccount = false;
 	const role = isFirstAccount ? "admin" : "user";
 
killedBy: authController @register should register a user
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/authController.js:15:25
 	}
 
 	// first registered user is admin
-	const isFirstAccount = (await User.countDocuments({})) === 0;
+	const isFirstAccount = true;
 	const role = isFirstAccount ? "admin" : "user";
 
killedBy: authController @register should create user with correct details
statusReason: expected false to be true

[Killed] StringLiteral
controllers/authController.js:16:42
 
 	// first registered user is admin
 	const isFirstAccount = (await User.countDocuments({})) === 0;
-	const role = isFirstAccount ? "admin" : "user";
+	const role = isFirstAccount ? "admin" : "";
 
 	const user = await User.create({ name, email, password, role });
killedBy: authController @register should create user with correct details
statusReason: expected false to be true

[Survived] StringLiteral
controllers/authController.js:16:32
 
 	// first registered user is admin
 	const isFirstAccount = (await User.countDocuments({})) === 0;
-	const role = isFirstAccount ? "admin" : "user";
+	const role = isFirstAccount ? "" : "user";
 
 	const user = await User.create({ name, email, password, role });

[Killed] BlockStatement
controllers/authController.js:24:35
 	res.status(StatusCodes.CREATED).json({ user: tokenUser });
 };
 
-const login = async (req, res) => {
-	const { email, password } = req.body;
-
-	if (!email || !password) {
-		throw new CustomError.BadRequestError("Please provide email and password");
-	}
-	const user = await User.findOne({ email });
-
-	if (!user) {
-		throw new CustomError.UnauthenticatedError("Invalid Credentials");
-	}
-
-	const isPasswordCorrect = await user.comparePassword(password);
-	if (!isPasswordCorrect) {
-		throw new CustomError.UnauthenticatedError("Invalid Credentials");
-	}
-	const tokenUser = createTokenUser(user);
-	attachCookiesToResponse({ res, user: tokenUser });
-	res.status(StatusCodes.OK).json({ user: tokenUser });
-};
+const login = async (req, res) => {};
 
 const logout = async (req, res) => {
killedBy: authController @login should login a user
statusReason: expected false to be true

[Killed] BlockStatement
controllers/authController.js:27:27
 const login = async (req, res) => {
 	const { email, password } = req.body;
 
-	if (!email || !password) {
-		throw new CustomError.BadRequestError("Please provide email and password");
-	}
+	if (!email || !password) {}
 	const user = await User.findOne({ email });
 
killedBy: authController @login should throw an error if email or password is missing
statusReason: expected 'UnauthenticatedError' to equal 'BadRequestError'

[Survived] ObjectLiteral
controllers/authController.js:30:34
 	if (!email || !password) {
 		throw new CustomError.BadRequestError("Please provide email and password");
 	}
-	const user = await User.findOne({ email });
+	const user = await User.findOne({});
 
 	if (!user) {

[Killed] BlockStatement
controllers/authController.js:32:13
 	}
 	const user = await User.findOne({ email });
 
-	if (!user) {
-		throw new CustomError.UnauthenticatedError("Invalid Credentials");
-	}
+	if (!user) {}
 
 	const isPasswordCorrect = await user.comparePassword(password);
killedBy: authController @login should throw an error if user does not exist
statusReason: expected 'TypeError' to equal 'UnauthenticatedError'

[Killed] StringLiteral
controllers/authController.js:33:46
 	const user = await User.findOne({ email });
 
 	if (!user) {
-		throw new CustomError.UnauthenticatedError("Invalid Credentials");
+		throw new CustomError.UnauthenticatedError("");
 	}
 
killedBy: authController @login should throw an error if user does not exist
statusReason: expected '' to equal 'Invalid Credentials'

[Killed] BooleanLiteral
controllers/authController.js:37:6
 	}
 
 	const isPasswordCorrect = await user.comparePassword(password);
-	if (!isPasswordCorrect) {
+	if (isPasswordCorrect) {
 		throw new CustomError.UnauthenticatedError("Invalid Credentials");
 	}
killedBy: authController @login should login a user
statusReason: Invalid Credentials

[Killed] ConditionalExpression
controllers/authController.js:37:6
 	}
 
 	const isPasswordCorrect = await user.comparePassword(password);
-	if (!isPasswordCorrect) {
+	if (true) {
 		throw new CustomError.UnauthenticatedError("Invalid Credentials");
 	}
killedBy: authController @login should login a user
statusReason: Invalid Credentials

[Killed] BlockStatement
controllers/authController.js:45:36
 	res.status(StatusCodes.OK).json({ user: tokenUser });
 };
 
-const logout = async (req, res) => {
-	res.cookie("token", "logout", {
-		httpOnly: true,
-		expires: new Date(Date.now()),
-	});
-	res.status(StatusCodes.OK).json({ msg: "user logged out" });
-};
+const logout = async (req, res) => {};
 
 module.exports = { register, login, logout };
killedBy: authController @logout should logout a user
statusReason: expected false to be true

[Killed] BooleanLiteral
controllers/authController.js:47:13
 
 const logout = async (req, res) => {
 	res.cookie("token", "logout", {
-		httpOnly: true,
+		httpOnly: false,
 		expires: new Date(Date.now()),
 	});
killedBy: authController @logout should set the correct logout cookie
statusReason: expected false to be true

[Survived] StringLiteral
controllers/authController.js:50:41
 		httpOnly: true,
 		expires: new Date(Date.now()),
 	});
-	res.status(StatusCodes.OK).json({ msg: "user logged out" });
+	res.status(StatusCodes.OK).json({ msg: "" });
 };
 
