[Killed] ConditionalExpression
controllers/orderController.js:16:6
 const createOrder = async (req, res) => {
 	const { items: cartItems, tax, shippingFee } = req.body;
 
-	if (!cartItems || cartItems.length < 1) {
+	if (false) {
 		throw new CustomError.BadRequestError("No cart items provided");
 	}
killedBy: orderController @createOrder should throw BadRequestError if no cart items are provided
statusReason: expected 'TypeError' to equal 'BadRequestError'
