[Survived] BlockStatement
controllers/orderController.js:8:55
 const CustomError = require("../errors");
 const { checkPermissions } = require("../utils");
 
-const fakeStripeAPI = async ({ amount, currency }) => {
-	const client_secret = "someRandomValue";
-	return { client_secret, amount };
-};
+const fakeStripeAPI = async ({ amount, currency }) => {};
 
 const createOrder = async (req, res) => {

[Killed] LogicalOperator
controllers/orderController.js:16:6
 const createOrder = async (req, res) => {
 	const { items: cartItems, tax, shippingFee } = req.body;
 
-	if (!cartItems || cartItems.length < 1) {
+	if (!cartItems && cartItems.length < 1) {
 		throw new CustomError.BadRequestError("No cart items provided");
 	}
killedBy: orderController @createOrder should throw BadRequestError if no cart items are provided
statusReason: expected 'TypeError' to equal 'BadRequestError'

[Killed] ConditionalExpression
controllers/orderController.js:16:20
 const createOrder = async (req, res) => {
 	const { items: cartItems, tax, shippingFee } = req.body;
 
-	if (!cartItems || cartItems.length < 1) {
+	if (!cartItems || false) {
 		throw new CustomError.BadRequestError("No cart items provided");
 	}
killedBy: orderController @createOrder should throw BadRequestError if no cart items are provided
statusReason: expected 'TypeError' to equal 'BadRequestError'

[Killed] BlockStatement
controllers/orderController.js:19:28
 	if (!cartItems || cartItems.length < 1) {
 		throw new CustomError.BadRequestError("No cart items provided");
 	}
-	if (!tax || !shippingFee) {
-		throw new CustomError.BadRequestError(
-			"Please provide tax and shipping fee"
-		);
-	}
+	if (!tax || !shippingFee) {}
 
 	let orderItems = [];
killedBy: orderController @createOrder should throw BadRequestError if no tax or shipping fee is provided
statusReason: expected 'NotFoundError' to equal 'BadRequestError'

[Killed] ConditionalExpression
controllers/orderController.js:19:6
 	if (!cartItems || cartItems.length < 1) {
 		throw new CustomError.BadRequestError("No cart items provided");
 	}
-	if (!tax || !shippingFee) {
+	if (true) {
 		throw new CustomError.BadRequestError(
 			"Please provide tax and shipping fee"
killedBy: orderController @createOrder should verify the structure of fakeStripeAPI response
statusReason: Please provide tax and shipping fee

[Killed] BlockStatement
controllers/orderController.js:28:32
 	let orderItems = [];
 	let subtotal = 0;
 
-	for (const item of cartItems) {
-		const dbProduct = await Product.findOne({ _id: item.product });
-		if (!dbProduct) {
-			throw new CustomError.NotFoundError(
-				`No product with id: ${item.product}`
-			);
-		}
-		const { name, price, image, _id } = dbProduct;
-		const singleOrderItem = {
-			amount: item.amount,
-			name,
-			price,
-			image,
-			product: _id,
-		};
-		// add item to order
-		orderItems = [...orderItems, singleOrderItem];
-		// calculate subtotal
-		subtotal += item.amount * price;
-	}
+	for (const item of cartItems) {}
 
 	// calculate total
killedBy: orderController @createOrder should throw NotFoundError if product is not found
statusReason: expected false to be true

[Survived] ObjectLiteral
controllers/orderController.js:29:43
 	let subtotal = 0;
 
 	for (const item of cartItems) {
-		const dbProduct = await Product.findOne({ _id: item.product });
+		const dbProduct = await Product.findOne({});
 		if (!dbProduct) {
 			throw new CustomError.NotFoundError(

[Killed] ConditionalExpression
controllers/orderController.js:30:7
 
 	for (const item of cartItems) {
 		const dbProduct = await Product.findOne({ _id: item.product });
-		if (!dbProduct) {
+		if (true) {
 			throw new CustomError.NotFoundError(
 				`No product with id: ${item.product}`
killedBy: orderController @createOrder should verify the structure of fakeStripeAPI response
statusReason: No product with id: prod1

[Killed] BooleanLiteral
controllers/orderController.js:30:7
 
 	for (const item of cartItems) {
 		const dbProduct = await Product.findOne({ _id: item.product });
-		if (!dbProduct) {
+		if (dbProduct) {
 			throw new CustomError.NotFoundError(
 				`No product with id: ${item.product}`
killedBy: orderController @createOrder should verify the structure of fakeStripeAPI response
statusReason: No product with id: prod1

[Killed] StringLiteral
controllers/orderController.js:32:5
 		const dbProduct = await Product.findOne({ _id: item.product });
 		if (!dbProduct) {
 			throw new CustomError.NotFoundError(
-				`No product with id: ${item.product}`
+				``
 			);
 		}
killedBy: orderController @createOrder should throw NotFoundError if product is not found
statusReason: expected '' to equal 'No product with id: 507f1f77bcf86cd79…'

[Survived] ArrayDeclaration
controllers/orderController.js:44:16
 			product: _id,
 		};
 		// add item to order
-		orderItems = [...orderItems, singleOrderItem];
+		orderItems = [];
 		// calculate subtotal
 		subtotal += item.amount * price;

[Survived] ArithmeticOperator
controllers/orderController.js:46:15
 		// add item to order
 		orderItems = [...orderItems, singleOrderItem];
 		// calculate subtotal
-		subtotal += item.amount * price;
+		subtotal += item.amount / price;
 	}
 

[Survived] AssignmentOperator
controllers/orderController.js:46:3
 		// add item to order
 		orderItems = [...orderItems, singleOrderItem];
 		// calculate subtotal
-		subtotal += item.amount * price;
+		subtotal -= item.amount * price;
 	}
 

[Survived] ArithmeticOperator
controllers/orderController.js:50:16
 	}
 
 	// calculate total
-	const total = tax + shippingFee + subtotal;
+	const total = tax - shippingFee + subtotal;
 	//get client secret
 	const paymentIntent = await fakeStripeAPI({

[Survived] ArithmeticOperator
controllers/orderController.js:50:16
 	}
 
 	// calculate total
-	const total = tax + shippingFee + subtotal;
+	const total = tax + shippingFee - subtotal;
 	//get client secret
 	const paymentIntent = await fakeStripeAPI({

[Killed] BlockStatement
controllers/orderController.js:72:42
 		.json({ order, clientSecret: order.clientSecret });
 };
 
-const getAllOrders = async (req, res) => {
-	const orders = await Order.find({});
-	res.status(StatusCodes.OK).json({ orders, count: orders.length });
-};
+const getAllOrders = async (req, res) => {};
 
 const getSingleOrder = async (req, res) => {
killedBy: orderController @getAllOrders should return all orders
statusReason: expected false to be true

[Killed] BlockStatement
controllers/orderController.js:77:44
 	res.status(StatusCodes.OK).json({ orders, count: orders.length });
 };
 
-const getSingleOrder = async (req, res) => {
-	const { id: orderId } = req.params;
-	const order = await Order.findOne({ _id: orderId });
-
-	if (!order) {
-		throw new CustomError.NotFoundError(`No order with id: ${orderId}`);
-	}
-
-	checkPermissions(req.user, order.user);
-	res.status(StatusCodes.OK).json({ order });
-};
+const getSingleOrder = async (req, res) => {};
 
 const getCurrentUserOrders = async (req, res) => {
killedBy: orderController @getSingleOrder should return a single order
statusReason: expected false to be true

[Killed] BlockStatement
controllers/orderController.js:81:14
 	const { id: orderId } = req.params;
 	const order = await Order.findOne({ _id: orderId });
 
-	if (!order) {
-		throw new CustomError.NotFoundError(`No order with id: ${orderId}`);
-	}
+	if (!order) {}
 
 	checkPermissions(req.user, order.user);
killedBy: orderController @getSingleOrder should return NotFoundError if order is not found
statusReason: expected 'TypeError' to equal 'NotFoundError'

[Killed] ObjectLiteral
controllers/orderController.js:86:34
 	}
 
 	checkPermissions(req.user, order.user);
-	res.status(StatusCodes.OK).json({ order });
+	res.status(StatusCodes.OK).json({});
 };
 
killedBy: orderController @getSingleOrder should return a single order
statusReason: expected false to be true

[Killed] BlockStatement
controllers/orderController.js:89:50
 	res.status(StatusCodes.OK).json({ order });
 };
 
-const getCurrentUserOrders = async (req, res) => {
-	const orders = await Order.find({ user: req.user.userId });
-	res.status(StatusCodes.OK).json({ orders, count: orders.length });
-};
+const getCurrentUserOrders = async (req, res) => {};
 
 const updateOrder = async (req, res) => {
killedBy: orderController @getCurrentUserOrders should return all orders for a user
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/orderController.js:90:34
 };
 
 const getCurrentUserOrders = async (req, res) => {
-	const orders = await Order.find({ user: req.user.userId });
+	const orders = await Order.find({});
 	res.status(StatusCodes.OK).json({ orders, count: orders.length });
 };
killedBy: orderController @getCurrentUserOrders should return all orders for a user
statusReason: expected false to be true

[Killed] BlockStatement
controllers/orderController.js:94:41
 	res.status(StatusCodes.OK).json({ orders, count: orders.length });
 };
 
-const updateOrder = async (req, res) => {
-	const { id: orderId } = req.params;
-	const { paymentIntentId } = req.body;
-	const order = await Order.findOne({ _id: orderId });
-
-	if (!order) {
-		throw new CustomError.NotFoundError(`No order with id: ${orderId}`);
-	}
-	checkPermissions(req.user, order.user);
-
-	order.paymentIntentId = paymentIntentId;
-	order.status = "paid";
-	await order.save();
-
-	res.status(StatusCodes.OK).json({ order });
-};
+const updateOrder = async (req, res) => {};
 
 module.exports = {
killedBy: orderController @updateOrder should update an order
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/orderController.js:99:6
 	const { paymentIntentId } = req.body;
 	const order = await Order.findOne({ _id: orderId });
 
-	if (!order) {
+	if (false) {
 		throw new CustomError.NotFoundError(`No order with id: ${orderId}`);
 	}
killedBy: orderController @updateOrder should return NotFoundError if order is not found
statusReason: expected 'TypeError' to equal 'NotFoundError'
