[Killed] BlockStatement
controllers/productController.js:6:43
 const { StatusCodes } = require("http-status-codes");
 const path = require("path");
 
-const createProduct = async (req, res) => {
-	req.body.user = req.user.userId;
-	const product = await Product.create(req.body);
-	res.status(StatusCodes.CREATED).json({ product });
-};
+const createProduct = async (req, res) => {};
 
 const getAllProducts = async (req, res) => {
killedBy: productController @createProduct should create a product
statusReason: expected false to be true

[Killed] BlockStatement
controllers/productController.js:12:44
 	res.status(StatusCodes.CREATED).json({ product });
 };
 
-const getAllProducts = async (req, res) => {
-	const products = await Product.find({});
-	res.status(StatusCodes.OK).json({ products, count: products.length });
-};
+const getAllProducts = async (req, res) => {};
 
 const getSingleProduct = async (req, res) => {
killedBy: productController @getAllProducts should get all products
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/productController.js:14:34
 
 const getAllProducts = async (req, res) => {
 	const products = await Product.find({});
-	res.status(StatusCodes.OK).json({ products, count: products.length });
+	res.status(StatusCodes.OK).json({});
 };
 
killedBy: productController @getAllProducts should get all products
statusReason: expected false to be true

[Killed] BlockStatement
controllers/productController.js:17:46
 	res.status(StatusCodes.OK).json({ products, count: products.length });
 };
 
-const getSingleProduct = async (req, res) => {
-	const { id: productId } = req.params;
-	const product = await Product.findOne({ _id: productId }).populate("reviews");
-
-	if (!product) {
-		throw new CustomError.NotFoundError(`No product with id: ${productId}`);
-	}
-	res.status(StatusCodes.OK).json({ product });
-};
+const getSingleProduct = async (req, res) => {};
 
 const updateProduct = async (req, res) => {
killedBy: productController @getSingleProduct should get a single product
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/productController.js:19:40
 
 const getSingleProduct = async (req, res) => {
 	const { id: productId } = req.params;
-	const product = await Product.findOne({ _id: productId }).populate("reviews");
+	const product = await Product.findOne({}).populate("reviews");
 
 	if (!product) {
killedBy: productController @getSingleProduct should get a single product
statusReason: expected false to be true

[Killed] StringLiteral
controllers/productController.js:19:69
 
 const getSingleProduct = async (req, res) => {
 	const { id: productId } = req.params;
-	const product = await Product.findOne({ _id: productId }).populate("reviews");
+	const product = await Product.findOne({ _id: productId }).populate("");
 
 	if (!product) {
killedBy: productController @getSingleProduct should get a single product
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/productController.js:24:34
 	if (!product) {
 		throw new CustomError.NotFoundError(`No product with id: ${productId}`);
 	}
-	res.status(StatusCodes.OK).json({ product });
+	res.status(StatusCodes.OK).json({});
 };
 
killedBy: productController @getSingleProduct should get a single product
statusReason: expected false to be true

[Killed] BlockStatement
controllers/productController.js:27:43
 	res.status(StatusCodes.OK).json({ product });
 };
 
-const updateProduct = async (req, res) => {
-	const { id: productId } = req.params;
-	const product = await Product.findOneAndUpdate({ _id: productId }, req.body, {
-		new: true,
-		runValidators: true,
-	});
-
-	if (!product) {
-		throw new CustomError.NotFoundError(`No product with id: ${productId}`);
-	}
-	res.status(StatusCodes.OK).json({ product });
-};
+const updateProduct = async (req, res) => {};
 
 const deleteProduct = async (req, res) => {
killedBy: productController @updateProduct should update a product
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/productController.js:29:79
 
 const updateProduct = async (req, res) => {
 	const { id: productId } = req.params;
-	const product = await Product.findOneAndUpdate({ _id: productId }, req.body, {
-		new: true,
-		runValidators: true,
-	});
+	const product = await Product.findOneAndUpdate({ _id: productId }, req.body, {});
 
 	if (!product) {
killedBy: productController @updateProduct should update a product
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/productController.js:29:49
 
 const updateProduct = async (req, res) => {
 	const { id: productId } = req.params;
-	const product = await Product.findOneAndUpdate({ _id: productId }, req.body, {
+	const product = await Product.findOneAndUpdate({}, req.body, {
 		new: true,
 		runValidators: true,
killedBy: productController @updateProduct should update a product
statusReason: expected false to be true

[Killed] BooleanLiteral
controllers/productController.js:30:8
 const updateProduct = async (req, res) => {
 	const { id: productId } = req.params;
 	const product = await Product.findOneAndUpdate({ _id: productId }, req.body, {
-		new: true,
+		new: false,
 		runValidators: true,
 	});
killedBy: productController @updateProduct should update a product
statusReason: expected false to be true

[Killed] BlockStatement
controllers/productController.js:40:43
 	res.status(StatusCodes.OK).json({ product });
 };
 
-const deleteProduct = async (req, res) => {
-	const { id: productId } = req.params;
-	const product = await Product.findOne({ _id: productId });
-
-	if (!product) {
-		throw new CustomError.NotFoundError(`No product with id: ${productId}`);
-	}
-
-	await product.remove();
-	res.status(StatusCodes.OK).json({ msg: "Success! Product removed" });
-};
+const deleteProduct = async (req, res) => {};
 
 const uploadImage = async (req, res) => {
killedBy: productController @deleteProduct should delete a product
statusReason: expected false to be true

[Killed] BlockStatement
controllers/productController.js:44:16
 	const { id: productId } = req.params;
 	const product = await Product.findOne({ _id: productId });
 
-	if (!product) {
-		throw new CustomError.NotFoundError(`No product with id: ${productId}`);
-	}
+	if (!product) {}
 
 	await product.remove();
killedBy: productController @deleteProduct should return NotFoundError if product is not found
statusReason: expected 'TypeError' to equal 'NotFoundError'

[Killed] BlockStatement
controllers/productController.js:52:41
 	res.status(StatusCodes.OK).json({ msg: "Success! Product removed" });
 };
 
-const uploadImage = async (req, res) => {
-	if (!req.files) {
-		throw new CustomError.BadRequestError("No File Uploaded");
-	}
-
-	const productImage = req.files.image;
-	if (!productImage.mimetype.startsWith("image")) {
-		throw new CustomError.BadRequestError("Please Upload Image");
-	}
-
-	const maxSize = 1024 * 1024;
-	if (productImage.size > maxSize) {
-		throw new CustomError.BadRequestError(
-			"Please Upload Image smaller than 1 MB"
-		);
-	}
-
-	const imagePath = path.join(
-		__dirname,
-		"../public/uploads/" + `${productImage.name}`
-	);
-	await productImage.mv(imagePath);
-
-	res.status(StatusCodes.OK).json({ image: `/uploads/${productImage.name}` });
-};
+const uploadImage = async (req, res) => {};
 
 module.exports = {
killedBy: productController @uploadImage should upload an image
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/productController.js:53:6
 };
 
 const uploadImage = async (req, res) => {
-	if (!req.files) {
+	if (false) {
 		throw new CustomError.BadRequestError("No File Uploaded");
 	}
killedBy: productController @uploadImage should throw BadRequestError if no file is uploaded
statusReason: expected 'TypeError' to equal 'BadRequestError'

[Killed] BlockStatement
controllers/productController.js:53:18
 };
 
 const uploadImage = async (req, res) => {
-	if (!req.files) {
-		throw new CustomError.BadRequestError("No File Uploaded");
-	}
+	if (!req.files) {}
 
 	const productImage = req.files.image;
killedBy: productController @uploadImage should throw BadRequestError if no file is uploaded
statusReason: expected 'TypeError' to equal 'BadRequestError'

[Killed] MethodExpression
controllers/productController.js:58:7
 	}
 
 	const productImage = req.files.image;
-	if (!productImage.mimetype.startsWith("image")) {
+	if (!productImage.mimetype.endsWith("image")) {
 		throw new CustomError.BadRequestError("Please Upload Image");
 	}
killedBy: productController @uploadImage should upload an image
statusReason: Please Upload Image

[Killed] ConditionalExpression
controllers/productController.js:58:6
 	}
 
 	const productImage = req.files.image;
-	if (!productImage.mimetype.startsWith("image")) {
+	if (true) {
 		throw new CustomError.BadRequestError("Please Upload Image");
 	}
killedBy: productController @uploadImage should upload an image
statusReason: Please Upload Image

[Killed] ArithmeticOperator
controllers/productController.js:62:18
 		throw new CustomError.BadRequestError("Please Upload Image");
 	}
 
-	const maxSize = 1024 * 1024;
+	const maxSize = 1024 / 1024;
 	if (productImage.size > maxSize) {
 		throw new CustomError.BadRequestError(
killedBy: productController @uploadImage should upload an image
statusReason: Please Upload Image smaller than 1 MB

[Killed] EqualityOperator
controllers/productController.js:63:6
 	}
 
 	const maxSize = 1024 * 1024;
-	if (productImage.size > maxSize) {
+	if (productImage.size <= maxSize) {
 		throw new CustomError.BadRequestError(
 			"Please Upload Image smaller than 1 MB"
killedBy: productController @uploadImage should upload an image
statusReason: Please Upload Image smaller than 1 MB

[Killed] ConditionalExpression
controllers/productController.js:63:6
 	}
 
 	const maxSize = 1024 * 1024;
-	if (productImage.size > maxSize) {
+	if (true) {
 		throw new CustomError.BadRequestError(
 			"Please Upload Image smaller than 1 MB"
killedBy: productController @uploadImage should upload an image
statusReason: Please Upload Image smaller than 1 MB

[Killed] StringLiteral
controllers/productController.js:65:4
 	const maxSize = 1024 * 1024;
 	if (productImage.size > maxSize) {
 		throw new CustomError.BadRequestError(
-			"Please Upload Image smaller than 1 MB"
+			""
 		);
 	}
killedBy: productController @uploadImage should throw BadRequestError if file size is greater than 1MB
statusReason: expected '' to equal 'Please Upload Image smaller than 1 MB'

[Survived] StringLiteral
controllers/productController.js:71:3
 
 	const imagePath = path.join(
 		__dirname,
-		"../public/uploads/" + `${productImage.name}`
+		"" + `${productImage.name}`
 	);
 	await productImage.mv(imagePath);

[Survived] StringLiteral
controllers/productController.js:75:43
 	);
 	await productImage.mv(imagePath);
 
-	res.status(StatusCodes.OK).json({ image: `/uploads/${productImage.name}` });
+	res.status(StatusCodes.OK).json({ image: `` });
 };
 
