[Killed] BlockStatement
controllers/reviewController.js:7:42
 const CustomError = require("../errors");
 const { checkPermissions } = require("../utils");
 
-const createReview = async (req, res) => {
-	const { product: productId } = req.body;
-
-	const isValidProduct = await Product.findOne({ _id: productId });
-	if (!isValidProduct) {
-		throw new CustomError.NotFoundError(`No product with id: ${productId}`);
-	}
-
-	const alreadySubmitted = await Review.findOne({
-		product: productId,
-		user: req.user.userId,
-	});
-	if (alreadySubmitted) {
-		throw new CustomError.BadRequestError(
-			"Already submitted review for this product"
-		);
-	}
-
-	req.body.user = req.user.userId;
-	const review = await Review.create(req.body);
-	res.status(StatusCodes.CREATED).json({ review });
-};
+const createReview = async (req, res) => {};
 
 const getAllReviews = async (req, res) => {
killedBy: reviewController createReview should create a review
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/reviewController.js:11:6
 	const { product: productId } = req.body;
 
 	const isValidProduct = await Product.findOne({ _id: productId });
-	if (!isValidProduct) {
+	if (true) {
 		throw new CustomError.NotFoundError(`No product with id: ${productId}`);
 	}
killedBy: reviewController createReview should create a review
statusReason: No product with id: 123

[Killed] BooleanLiteral
controllers/reviewController.js:11:6
 	const { product: productId } = req.body;
 
 	const isValidProduct = await Product.findOne({ _id: productId });
-	if (!isValidProduct) {
+	if (isValidProduct) {
 		throw new CustomError.NotFoundError(`No product with id: ${productId}`);
 	}
killedBy: reviewController createReview should create a review
statusReason: No product with id: 123

[Killed] ObjectLiteral
controllers/reviewController.js:15:48
 		throw new CustomError.NotFoundError(`No product with id: ${productId}`);
 	}
 
-	const alreadySubmitted = await Review.findOne({
-		product: productId,
-		user: req.user.userId,
-	});
+	const alreadySubmitted = await Review.findOne({});
 	if (alreadySubmitted) {
 		throw new CustomError.BadRequestError(
killedBy: reviewController createReview should create a review
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/reviewController.js:19:6
 		product: productId,
 		user: req.user.userId,
 	});
-	if (alreadySubmitted) {
+	if (true) {
 		throw new CustomError.BadRequestError(
 			"Already submitted review for this product"
killedBy: reviewController createReview should create a review
statusReason: Already submitted review for this product

[Survived] BlockStatement
controllers/reviewController.js:19:24
 		product: productId,
 		user: req.user.userId,
 	});
-	if (alreadySubmitted) {
-		throw new CustomError.BadRequestError(
-			"Already submitted review for this product"
-		);
-	}
+	if (alreadySubmitted) {}
 
 	req.body.user = req.user.userId;

[Killed] BlockStatement
controllers/reviewController.js:30:43
 	res.status(StatusCodes.CREATED).json({ review });
 };
 
-const getAllReviews = async (req, res) => {
-	const reviews = await Review.find({})
-		.populate({
-			path: "product",
-			select: "name company price",
-		})
-		.populate({
-			path: "user",
-			select: "name",
-		});
-	res.status(StatusCodes.OK).json({ reviews });
-};
+const getAllReviews = async (req, res) => {};
 
 const getSingleReview = async (req, res) => {
killedBy: reviewController getAllReviews should get all reviews
statusReason: expected false to be true

[Killed] StringLiteral
controllers/reviewController.js:37:10
 			select: "name company price",
 		})
 		.populate({
-			path: "user",
+			path: "",
 			select: "name",
 		});
killedBy: reviewController getAllReviews should get all reviews
statusReason: expected false to be true

[Killed] StringLiteral
controllers/reviewController.js:38:12
 		})
 		.populate({
 			path: "user",
-			select: "name",
+			select: "",
 		});
 	res.status(StatusCodes.OK).json({ reviews });
killedBy: reviewController getAllReviews should get all reviews
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/reviewController.js:40:34
 			path: "user",
 			select: "name",
 		});
-	res.status(StatusCodes.OK).json({ reviews });
+	res.status(StatusCodes.OK).json({});
 };
 
killedBy: reviewController getAllReviews should get all reviews
statusReason: expected false to be true

[Killed] BlockStatement
controllers/reviewController.js:43:45
 	res.status(StatusCodes.OK).json({ reviews });
 };
 
-const getSingleReview = async (req, res) => {
-	const { id: reviewId } = req.params;
-
-	const review = await Review.findOne({ _id: reviewId });
-	if (!review) {
-		throw new CustomError.NotFoundError(`No review with id ${reviewId}`);
-	}
-	res.status(StatusCodes.OK).json({ review });
-};
+const getSingleReview = async (req, res) => {};
 
 const updateReview = async (req, res) => {
killedBy: reviewController getSingleReview should get a single review
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/reviewController.js:47:6
 	const { id: reviewId } = req.params;
 
 	const review = await Review.findOne({ _id: reviewId });
-	if (!review) {
+	if (true) {
 		throw new CustomError.NotFoundError(`No review with id ${reviewId}`);
 	}
killedBy: reviewController getSingleReview should get a single review
statusReason: No review with id 123

[Killed] BooleanLiteral
controllers/reviewController.js:47:6
 	const { id: reviewId } = req.params;
 
 	const review = await Review.findOne({ _id: reviewId });
-	if (!review) {
+	if (review) {
 		throw new CustomError.NotFoundError(`No review with id ${reviewId}`);
 	}
killedBy: reviewController getSingleReview should get a single review
statusReason: No review with id 123

[Killed] StringLiteral
controllers/reviewController.js:48:39
 
 	const review = await Review.findOne({ _id: reviewId });
 	if (!review) {
-		throw new CustomError.NotFoundError(`No review with id ${reviewId}`);
+		throw new CustomError.NotFoundError(``);
 	}
 	res.status(StatusCodes.OK).json({ review });
killedBy: reviewController getSingleReview should return NotFoundError if review is not found
statusReason: expected '' to equal 'No review with id 123'

[Killed] BlockStatement
controllers/reviewController.js:53:42
 	res.status(StatusCodes.OK).json({ review });
 };
 
-const updateReview = async (req, res) => {
-	const { id: reviewId } = req.params;
-	const { rating, title, comment } = req.body;
-
-	const review = await Review.findOne({ _id: reviewId });
-	if (!review) {
-		throw new CustomError.NotFoundError(`No review with id ${reviewId}`);
-	}
-
-	checkPermissions(req.user, review.user);
-
-	review.rating = rating;
-	review.title = title;
-	review.comment = comment;
-
-	await review.save();
-	res.status(StatusCodes.OK).json({ review });
-};
+const updateReview = async (req, res) => {};
 
 const deleteReview = async (req, res) => {
killedBy: reviewController updateReview should update a review
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/reviewController.js:58:6
 	const { rating, title, comment } = req.body;
 
 	const review = await Review.findOne({ _id: reviewId });
-	if (!review) {
+	if (false) {
 		throw new CustomError.NotFoundError(`No review with id ${reviewId}`);
 	}
killedBy: reviewController updateReview should return NotFoundError if review is not found
statusReason: expected 'TypeError' to equal 'NotFoundError'

[Killed] BlockStatement
controllers/reviewController.js:72:42
 	res.status(StatusCodes.OK).json({ review });
 };
 
-const deleteReview = async (req, res) => {
-	const { id: reviewId } = req.params;
-
-	const review = await Review.findOne({ _id: reviewId });
-	if (!review) {
-		throw new CustomError.NotFoundError(`No review with id ${reviewId}`);
-	}
-
-	checkPermissions(req.user, review.user);
-
-	await review.remove();
-
-	res.status(StatusCodes.OK).json({ msg: "Success! Review deleted" });
-};
+const deleteReview = async (req, res) => {};
 
 const getSingleProductReviews = async (req, res) => {
killedBy: reviewController deleteReview should delete a review
statusReason: expected false to be true

[Killed] StringLiteral
controllers/reviewController.js:84:41
 
 	await review.remove();
 
-	res.status(StatusCodes.OK).json({ msg: "Success! Review deleted" });
+	res.status(StatusCodes.OK).json({ msg: "" });
 };
 
killedBy: reviewController deleteReview should delete a review
statusReason: expected false to be true

[Killed] BlockStatement
controllers/reviewController.js:87:53
 	res.status(StatusCodes.OK).json({ msg: "Success! Review deleted" });
 };
 
-const getSingleProductReviews = async (req, res) => {
-	const { id: productId } = req.params;
-	const reviews = await Review.find({ product: productId });
-	res.status(StatusCodes.OK).json({ reviews, count: reviews.length });
-};
+const getSingleProductReviews = async (req, res) => {};
 
 module.exports = {
killedBy: reviewController getSingleProductReviews should get all reviews for a product
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/reviewController.js:90:34
 const getSingleProductReviews = async (req, res) => {
 	const { id: productId } = req.params;
 	const reviews = await Review.find({ product: productId });
-	res.status(StatusCodes.OK).json({ reviews, count: reviews.length });
+	res.status(StatusCodes.OK).json({});
 };
 
killedBy: reviewController getSingleProductReviews should get all reviews for a product
statusReason: expected false to be true
