[Killed] BlockStatement
controllers/userController.js:6:41
 const CustomError = require("../errors");
 const { createTokenUser, attachCookiesToResponse, checkPermissions } = require("../utils");
 
-const getAllUsers = async (req, res) => {
-	const users = await User.find({ role: "user" }).select("-password");
-	res.status(StatusCodes.OK).json({ users });
-};
+const getAllUsers = async (req, res) => {};
 
 const getSingleUser = async (req, res) => {
killedBy: userController @getAllUsers should return all users with role user
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/userController.js:8:34
 
 const getAllUsers = async (req, res) => {
 	const users = await User.find({ role: "user" }).select("-password");
-	res.status(StatusCodes.OK).json({ users });
+	res.status(StatusCodes.OK).json({});
 };
 
killedBy: userController @getAllUsers should return all users with role user
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:11:43
 	res.status(StatusCodes.OK).json({ users });
 };
 
-const getSingleUser = async (req, res) => {
-	console.log(req.user);
-	const user = await User.findOne({ _id: req.params.id }).select("-password");
-	if (!user) {
-		throw new CustomError.NotFoundError(`No user with id: ${req.params.id}`);
-	}
-	checkPermissions(req.user, user._id)
-	res.status(StatusCodes.OK).json({ user });
-};
+const getSingleUser = async (req, res) => {};
 
 const showCurrentUser = async (req, res) => {
killedBy: userController @getSingleUser should return user if found
statusReason: expected false to be true

[Survived] StringLiteral
controllers/userController.js:13:65
 
 const getSingleUser = async (req, res) => {
 	console.log(req.user);
-	const user = await User.findOne({ _id: req.params.id }).select("-password");
+	const user = await User.findOne({ _id: req.params.id }).select("");
 	if (!user) {
 		throw new CustomError.NotFoundError(`No user with id: ${req.params.id}`);

[Killed] BooleanLiteral
controllers/userController.js:14:6
 const getSingleUser = async (req, res) => {
 	console.log(req.user);
 	const user = await User.findOne({ _id: req.params.id }).select("-password");
-	if (!user) {
+	if (user) {
 		throw new CustomError.NotFoundError(`No user with id: ${req.params.id}`);
 	}
killedBy: userController @getSingleUser should throw NotFoundError if no user is found
statusReason: expected 'TypeError' to equal 'NotFoundError'

[Killed] ConditionalExpression
controllers/userController.js:14:6
 const getSingleUser = async (req, res) => {
 	console.log(req.user);
 	const user = await User.findOne({ _id: req.params.id }).select("-password");
-	if (!user) {
+	if (false) {
 		throw new CustomError.NotFoundError(`No user with id: ${req.params.id}`);
 	}
killedBy: userController @getSingleUser should throw NotFoundError if no user is found
statusReason: expected 'TypeError' to equal 'NotFoundError'

[Killed] BlockStatement
controllers/userController.js:21:45
 	res.status(StatusCodes.OK).json({ user });
 };
 
-const showCurrentUser = async (req, res) => {
-	res.status(StatusCodes.OK).json({ user: req.user });
-};
+const showCurrentUser = async (req, res) => {};
 
 // update user with user.save()
killedBy: userController @showCurrentUser should return current user
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:26:40
 };
 
 // update user with user.save()
-const updateUser = async (req, res) => {
-	const { email, name } = req.body;
-	if (!email || !name) {
-		throw new CustomError.BadRequestError("Please provide all values");
-	}
-
-	const user = await User.findOne({ _id: req.user.userId });
-	user.email = email;
-	user.name = name;
-
-	await user.save();
-
-	const tokenUser = createTokenUser(user);
-	attachCookiesToResponse({ res, user: tokenUser });
-	res.status(StatusCodes.OK).json({ user: tokenUser });
-};
+const updateUser = async (req, res) => {};
 
 const updateUserPassword = async (req, res) => {
killedBy: userController @updateUser should update user with email and name
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:28:23
 // update user with user.save()
 const updateUser = async (req, res) => {
 	const { email, name } = req.body;
-	if (!email || !name) {
-		throw new CustomError.BadRequestError("Please provide all values");
-	}
+	if (!email || !name) {}
 
 	const user = await User.findOne({ _id: req.user.userId });
killedBy: userController @updateUser should throw BadRequestError if email or name is missing
statusReason: expected 'TypeError' to equal 'BadRequestError'

[Killed] ConditionalExpression
controllers/userController.js:28:6
 // update user with user.save()
 const updateUser = async (req, res) => {
 	const { email, name } = req.body;
-	if (!email || !name) {
+	if (true) {
 		throw new CustomError.BadRequestError("Please provide all values");
 	}
killedBy: userController @updateUser should update user with email and name
statusReason: Please provide all values

[Survived] ObjectLiteral
controllers/userController.js:39:26
 	await user.save();
 
 	const tokenUser = createTokenUser(user);
-	attachCookiesToResponse({ res, user: tokenUser });
+	attachCookiesToResponse({});
 	res.status(StatusCodes.OK).json({ user: tokenUser });
 };

[Survived] ObjectLiteral
controllers/userController.js:40:34
 
 	const tokenUser = createTokenUser(user);
 	attachCookiesToResponse({ res, user: tokenUser });
-	res.status(StatusCodes.OK).json({ user: tokenUser });
+	res.status(StatusCodes.OK).json({});
 };
 

[Killed] BlockStatement
controllers/userController.js:43:48
 	res.status(StatusCodes.OK).json({ user: tokenUser });
 };
 
-const updateUserPassword = async (req, res) => {
-	const { oldPassword, newPassword } = req.body;
-	if (!oldPassword || !newPassword) {
-		throw new CustomError.BadRequestError("Please provide both values");
-	}
-	const user = await User.findOne({ _id: req.user.userId });
-
-	const isPasswordCorrect = await user.comparePassword(oldPassword);
-	if (!isPasswordCorrect) {
-		throw new CustomError.UnauthenticatedError("Invalid Credentials");
-	}
-
-	user.password = newPassword;
-	await user.save();
-	res.status(StatusCodes.OK).json({ msg: "Success! Password Updated" });
-};
+const updateUserPassword = async (req, res) => {};
 
 module.exports = {
killedBy: userController @updateUserPassword should update user password
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/userController.js:45:6
 
 const updateUserPassword = async (req, res) => {
 	const { oldPassword, newPassword } = req.body;
-	if (!oldPassword || !newPassword) {
+	if (true) {
 		throw new CustomError.BadRequestError("Please provide both values");
 	}
killedBy: userController @updateUserPassword should throw UnauthenticatedError if oldPassword is incorrect
statusReason: expected 'BadRequestError' to equal 'UnauthenticatedError'

[Killed] BooleanLiteral
controllers/userController.js:45:6
 
 const updateUserPassword = async (req, res) => {
 	const { oldPassword, newPassword } = req.body;
-	if (!oldPassword || !newPassword) {
+	if (oldPassword || !newPassword) {
 		throw new CustomError.BadRequestError("Please provide both values");
 	}
killedBy: userController @updateUserPassword should throw BadRequestError if oldPassword or newPassword is missing
statusReason: expected 'TypeError' to equal 'BadRequestError'

[Survived] ObjectLiteral
controllers/userController.js:48:34
 	if (!oldPassword || !newPassword) {
 		throw new CustomError.BadRequestError("Please provide both values");
 	}
-	const user = await User.findOne({ _id: req.user.userId });
+	const user = await User.findOne({});
 
 	const isPasswordCorrect = await user.comparePassword(oldPassword);

[Killed] BlockStatement
controllers/userController.js:51:26
 	const user = await User.findOne({ _id: req.user.userId });
 
 	const isPasswordCorrect = await user.comparePassword(oldPassword);
-	if (!isPasswordCorrect) {
-		throw new CustomError.UnauthenticatedError("Invalid Credentials");
-	}
+	if (!isPasswordCorrect) {}
 
 	user.password = newPassword;
killedBy: userController @updateUserPassword should throw UnauthenticatedError if oldPassword is incorrect
statusReason: expected 'TypeError' to equal 'UnauthenticatedError'

[Killed] ConditionalExpression
controllers/userController.js:51:6
 	const user = await User.findOne({ _id: req.user.userId });
 
 	const isPasswordCorrect = await user.comparePassword(oldPassword);
-	if (!isPasswordCorrect) {
+	if (true) {
 		throw new CustomError.UnauthenticatedError("Invalid Credentials");
 	}
killedBy: userController @updateUserPassword should update user password
statusReason: Invalid Credentials

[Survived] StringLiteral
controllers/userController.js:57:41
 
 	user.password = newPassword;
 	await user.save();
-	res.status(StatusCodes.OK).json({ msg: "Success! Password Updated" });
+	res.status(StatusCodes.OK).json({ msg: "" });
 };
 

[Survived] ObjectLiteral
controllers/userController.js:57:34
 
 	user.password = newPassword;
 	await user.save();
-	res.status(StatusCodes.OK).json({ msg: "Success! Password Updated" });
+	res.status(StatusCodes.OK).json({});
 };
 
